---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationTopElevationIncludeInsulationOfPart
source: html/befcc5e9-3025-22c8-4acc-a4425fe758f7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationTopElevationIncludeInsulationOfPart Property

"Top Elevation with Insulation"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationTopElevationIncludeInsulationOfPart { get; }
```